Revit 2027 API
ParameterTypeId.AnalyticalModelColumnBaseExtension Property
 "Base x Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelColumnBaseExtension { get; }
Public Shared ReadOnly Property AnalyticalModelColumnBaseExtension As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelColumnBaseExtension {
	ForgeTypeId^ get ();
}
static member AnalyticalModelColumnBaseExtension : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace